#include "quadruped_controller/control/Estimator.h"
#include "quadruped_controller/control/CtrlComponent.h"

namespace quadruped_controller {
// 状态估计器可以估计的状态量xHat_均为当前世界坐标系{s}下的机器人状态：
//（1）机身位置pb；（2）机身速度vb；（3）四个足端位置p0，p1，p2，p3

//将机身加速度视为系统输入u，可以推导得到系统状态方程。
//这里输入u就是机身加速度，这个量通过IMU得到。
// 通过IMU可以得到世界坐标系{s}下的机身姿态Rsb，机身坐标系{b}下的加速度ab，以及旋转角速度wb
KalmanFilterEstimate::KalmanFilterEstimate(CtrlInterfaces &ctrl_interfaces,
                                           CtrlComponent &ctrl_component)
    : ctrl_interfaces_(ctrl_interfaces),
      robot_model_(ctrl_component.robot_model_),
      wave_generator_(ctrl_component.wave_generator_) {

  g_ << 0, 0, -9.81;
  dt_ = 1.0 / ctrl_interfaces.frequency_;

  std::cout << "dt: " << dt_ << std::endl;
  large_variance_ = 100;

  x_hat_.setZero();
  feet_pos_body_.setZero();
  feet_vel_body_.setZero();
  A.setIdentity();
  B.setZero();
  C.setZero();
  // 使用euler近似法离散化得到，考虑加速度对位置的影响，对应
  // p_k+1 = p_k + v_k * dt + 0.5 * a_k * dt^2
  B.block(0, 0, 3, 3) = 0.5 * dt_ * dt_ * Mat3::Identity();
  // 速度的更新，对应 v_k+1 = v_k + a_k * dt
  B.block(3, 0, 3, 3) = dt_ * Mat3::Identity();

  Eigen::Matrix<double, 3, 6> c1;
  Eigen::Matrix<double, 3, 6> c2;
  c1 << Mat3::Identity(), Mat3::Zero();
  c2 << Mat3::Zero(), Mat3::Identity();
  for (std::size_t i = 0; i < 4; ++i) {
    C.block(i * 3, 0, 3, 6) = c1;
    C.block(3 * (i + 4), 0, 3, 6) = c2;
    C(2 * 12 + i, 6 + 3 * i + 2) = 1.0;
  }

  C.block(0, 6, 12, 12) = -Mat12::Identity();

  for (int i(0); i < Qdig.rows(); ++i) {
    Qdig(i) = i < 6 ? 0.0003 : 0.01;
  }
  Q.setIdentity();
  P = large_variance_ * Q;

  // Cu 就是输入 u 的噪声协方差矩阵（3×3），描述加速度测量在各轴上有多不确定
  Cu << 268.573, -43.819, -147.211, -43.819, 92.949, 58.082, -147.211, 58.082,
      302.120;
  Eigen::MatrixXd Q_diag_dense = Qdig.asDiagonal();
  QInit_ = Q_diag_dense // 基础过程噪声（状态转移本身的不确定性）
           + B * Cu * B.transpose(); // 输入噪声经 B 矩阵传播到状态的噪声

  RInit_ << 0.008, 0.012, -0.000, -0.009, 0.012, 0.000, 0.009, -0.009, -0.000,
      -0.009, -0.009, 0.000, -0.000, 0.000, -0.000, 0.000, -0.000, -0.001,
      -0.002, 0.000, -0.000, -0.003, -0.000, -0.001, 0.000, 0.000, 0.000, 0.000,
      0.012, 0.019, -0.001, -0.014, 0.018, -0.000, 0.014, -0.013, -0.000,
      -0.014, -0.014, 0.001, -0.001, 0.001, -0.001, 0.000, 0.000, -0.001,
      -0.003, 0.000, -0.001, -0.004, -0.000, -0.001, 0.000, 0.000, 0.000, 0.000,
      -0.000, -0.001, 0.001, 0.001, -0.001, 0.000, -0.000, 0.000, -0.000, 0.001,
      0.000, -0.000, 0.000, -0.000, 0.000, 0.000, -0.000, -0.000, 0.000, -0.000,
      -0.000, -0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, -0.009, -0.014,
      0.001, 0.010, -0.013, 0.000, -0.010, 0.010, 0.000, 0.010, 0.010, -0.000,
      0.001, 0.000, 0.000, 0.001, -0.000, 0.001, 0.002, -0.000, 0.000, 0.003,
      0.000, 0.001, 0.000, 0.000, 0.000, 0.000, 0.012, 0.018, -0.001, -0.013,
      0.018, -0.000, 0.013, -0.013, -0.000, -0.013, -0.013, 0.001, -0.001,
      0.000, -0.001, 0.000, 0.001, -0.001, -0.003, 0.000, -0.001, -0.004,
      -0.000, -0.001, 0.000, 0.000, 0.000, 0.000, 0.000, -0.000, 0.000, 0.000,
      -0.000, 0.001, 0.000, 0.000, -0.000, 0.000, 0.000, -0.000, -0.000, 0.000,
      -0.000, 0.000, 0.000, 0.000, -0.000, -0.000, -0.000, -0.000, 0.000, 0.000,
      0.000, 0.000, 0.000, 0.000, 0.009, 0.014, -0.000, -0.010, 0.013, 0.000,
      0.010, -0.010, -0.000, -0.010, -0.010, 0.000, -0.001, 0.000, -0.001,
      0.000, -0.000, -0.001, -0.001, 0.000, -0.000, -0.003, -0.000, -0.001,
      0.000, 0.000, 0.000, 0.000, -0.009, -0.013, 0.000, 0.010, -0.013, 0.000,
      -0.010, 0.009, 0.000, 0.010, 0.010, -0.000, 0.001, -0.000, 0.000, -0.000,
      0.000, 0.001, 0.002, 0.000, 0.000, 0.003, 0.000, 0.001, 0.000, 0.000,
      0.000, 0.000, -0.000, -0.000, -0.000, 0.000, -0.000, -0.000, -0.000,
      0.000, 0.001, 0.000, 0.000, 0.000, 0.000, -0.000, 0.000, -0.000, 0.000,
      -0.000, 0.000, -0.000, 0.000, 0.000, -0.000, -0.000, 0.000, 0.000, 0.000,
      0.000, -0.009, -0.014, 0.001, 0.010, -0.013, 0.000, -0.010, 0.010, 0.000,
      0.010, 0.010, -0.000, 0.001, 0.000, 0.000, -0.000, -0.000, 0.001, 0.002,
      -0.000, 0.000, 0.003, 0.000, 0.001, 0.000, 0.000, 0.000, 0.000, -0.009,
      -0.014, 0.000, 0.010, -0.013, 0.000, -0.010, 0.010, 0.000, 0.010, 0.010,
      -0.000, 0.001, -0.000, 0.000, -0.000, 0.000, 0.001, 0.002, -0.000, 0.000,
      0.003, 0.001, 0.001, 0.000, 0.000, 0.000, 0.000, 0.000, 0.001, -0.000,
      -0.000, 0.001, -0.000, 0.000, -0.000, 0.000, -0.000, -0.000, 0.001, 0.000,
      -0.000, -0.000, -0.000, 0.000, 0.000, -0.000, 0.000, 0.000, 0.000, 0.000,
      0.000, 0.000, 0.000, 0.000, 0.000, -0.000, -0.001, 0.000, 0.001, -0.001,
      -0.000, -0.001, 0.001, 0.000, 0.001, 0.001, 0.000, 1.708, 0.048, 0.784,
      0.062, 0.042, 0.053, 0.077, 0.001, -0.061, 0.046, -0.019, -0.029, 0.000,
      0.000, 0.000, 0.000, 0.000, 0.001, -0.000, 0.000, 0.000, 0.000, 0.000,
      -0.000, -0.000, 0.000, -0.000, -0.000, 0.048, 5.001, -1.631, -0.036,
      0.144, 0.040, 0.036, 0.016, -0.051, -0.067, -0.024, -0.005, 0.000, 0.000,
      0.000, 0.000, -0.000, -0.001, 0.000, 0.000, -0.001, -0.000, -0.001, 0.000,
      0.000, 0.000, 0.000, -0.000, 0.784, -1.631, 1.242, 0.057, -0.037, 0.018,
      0.034, -0.017, -0.015, 0.058, -0.021, -0.029, 0.000, 0.000, 0.000, 0.000,
      0.000, 0.000, 0.000, 0.001, 0.000, 0.000, 0.000, -0.000, -0.000, -0.000,
      -0.000, -0.000, 0.062, -0.036, 0.057, 6.228, -0.014, 0.932, 0.059, 0.053,
      -0.069, 0.148, 0.015, -0.031, 0.000, 0.000, 0.000, 0.000, -0.000, 0.000,
      -0.000, -0.000, 0.001, 0.000, -0.000, 0.000, 0.000, -0.000, 0.000, 0.000,
      0.042, 0.144, -0.037, -0.014, 3.011, 0.986, 0.076, 0.030, -0.052, -0.027,
      0.057, 0.051, 0.000, 0.000, 0.000, 0.000, -0.001, -0.001, -0.000, 0.001,
      -0.001, 0.000, -0.001, 0.001, -0.000, 0.001, 0.001, 0.000, 0.053, 0.040,
      0.018, 0.932, 0.986, 0.885, 0.090, 0.044, -0.055, 0.057, 0.051, -0.003,
      0.000, 0.000, 0.000, 0.000, -0.002, -0.003, 0.000, 0.002, -0.003, -0.000,
      -0.001, 0.002, 0.000, 0.002, 0.002, -0.000, 0.077, 0.036, 0.034, 0.059,
      0.076, 0.090, 6.230, 0.139, 0.763, 0.013, -0.019, -0.024, 0.000, 0.000,
      0.000, 0.000, 0.000, 0.000, -0.000, -0.000, 0.000, -0.000, 0.000, 0.000,
      -0.000, -0.000, -0.000, 0.000, 0.001, 0.016, -0.017, 0.053, 0.030, 0.044,
      0.139, 3.130, -1.128, -0.010, 0.131, 0.018, 0.000, 0.000, 0.000, 0.000,
      -0.000, -0.001, -0.000, 0.000, -0.001, -0.000, -0.000, 0.000, 0.000,
      0.000, 0.000, 0.000, -0.061, -0.051, -0.015, -0.069, -0.052, -0.055,
      0.763, -1.128, 0.866, -0.022, -0.053, 0.007, 0.000, 0.000, 0.000, 0.000,
      -0.003, -0.004, -0.000, 0.003, -0.004, -0.000, -0.003, 0.003, 0.000,
      0.003, 0.003, 0.000, 0.046, -0.067, 0.058, 0.148, -0.027, 0.057, 0.013,
      -0.010, -0.022, 2.437, -0.102, 0.938, 0.000, 0.000, 0.000, 0.000, -0.000,
      -0.000, 0.000, 0.000, -0.000, 0.000, -0.000, 0.000, -0.000, 0.000, 0.001,
      0.000, -0.019, -0.024, -0.021, 0.015, 0.057, 0.051, -0.019, 0.131, -0.053,
      -0.102, 4.944, 1.724, 0.000, 0.000, 0.000, 0.000, -0.001, -0.001, 0.000,
      0.001, -0.001, 0.000, -0.001, 0.001, -0.000, 0.001, 0.001, 0.000, -0.029,
      -0.005, -0.029, -0.031, 0.051, -0.003, -0.024, 0.018, 0.007, 0.938, 1.724,
      1.569, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000,
      0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000,
      0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 1.0, 0.000,
      0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000,
      0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000,
      0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 1.0, 0.000, 0.000, 0.000,
      0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000,
      0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000,
      0.000, 0.000, 0.000, 0.000, 0.000, 1.0, 0.000, 0.000, 0.000, 0.000, 0.000,
      0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000,
      0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000,
      0.000, 0.000, 0.000, 1.0;

  R.setIdentity();
  feet_h_.setZero();

  low_pass_filters_.resize(3);
  low_pass_filters_[0] = std::make_shared<LowPassFilter>(dt_, 3.0);
  low_pass_filters_[1] = std::make_shared<LowPassFilter>(dt_, 3.0);
  low_pass_filters_[2] = std::make_shared<LowPassFilter>(dt_, 3.0);
}

double KalmanFilterEstimate::getYaw() const {
  return rotMatToRPY(rotation_)[2];
}

void KalmanFilterEstimate::update() {
  if (robot_model_->mass_ == 0)
    return;

  Q = QInit_;
  R = RInit_;

  A.block(0, 3, 3, 3) = dt_ * Mat3::Identity(); // A=I+dt*Ac
  // 过程噪声协方差矩阵，描述过程中机身位置噪声的不确定性
  Q.block(0, 0, 3, 3) = (dt_ / 20.f) * Mat3::Identity() * 0.02;
  // 描述过程中机身速度噪声的不确定性
  Q.block(3, 3, 3, 3) = (dt_ * 9.81f / 20.f) * Mat3::Identity() * 0.02;
  // 描述过程中足端位置噪声的不确定性
  Q.block(6, 6, 12, 12) = dt_ * Mat12::Identity() * 0.002;

  R.block(0, 0, 12, 12) = Mat12::Identity() * 0.005;
  R.block(12, 12, 12, 12) = Mat12::Identity() * 0.1;
  R.block(24, 24, 4, 4) = Eigen::Matrix4d::Identity() * 0.01;

  foot_poses_ = robot_model_->getFeet2BPositions();
  foot_vels_ = robot_model_->getFeet2BVelocities();

  for (int i(0); i < 4; ++i) {
    int i1 = 3 * i;
    int qIndex = 6 + i1;
    int rIndex1 = i1;
    int rIndex2 = 12 + rIndex1;
    int rIndex3 = 2 * 12 + i;

    const double trust = windowFunc(wave_generator_->phase_[i], 0.2);
    if (wave_generator_->contact_[i] == 0) {
      Q.block(qIndex, qIndex, 3, 3) = large_variance_ * Mat3::Identity(3, 3);
      R.block(rIndex2, rIndex2, 3, 3) = large_variance_ * Mat3::Identity(3, 3);
      R(rIndex3, rIndex3) = large_variance_;
    } else {
      // foot contact
      Q.block(qIndex, qIndex, 3, 3) = (1 + (1 - trust) * large_variance_) *
                                      QInit_.block(6 + 3 * i, 6 + 3 * i, 3, 3);
      R.block(rIndex2, rIndex2, 3, 3) =
          (1 + (1 - trust) * large_variance_) *
          RInit_.block(12 + 3 * i, 12 + 3 * i, 3, 3);
      R(rIndex3, rIndex3) =
          (1 + (1 - trust) * large_variance_) * RInit_(24 + i, 24 + i);
    }
    feet_pos_body_.segment(3 * i, 3) = -Vec3(foot_poses_[i].translation());
    feet_pos_body_.segment(3 * i, 3)[2] += 0.02;
    feet_vel_body_.segment(3 * i, 3) = -Vec3(foot_vels_[i]);
  }

  Quat quat;
  quat << ctrl_interfaces_.imu_state_interface_[0].get().get_value(),
      ctrl_interfaces_.imu_state_interface_[1].get().get_value(),
      ctrl_interfaces_.imu_state_interface_[2].get().get_value(),
      ctrl_interfaces_.imu_state_interface_[3].get().get_value();
  rotation_ = quatToRotMat(quat);

  gyro_ << ctrl_interfaces_.imu_state_interface_[4].get().get_value(),
      ctrl_interfaces_.imu_state_interface_[5].get().get_value(),
      ctrl_interfaces_.imu_state_interface_[6].get().get_value();

  acceleration_ << ctrl_interfaces_.imu_state_interface_[7].get().get_value(),
      ctrl_interfaces_.imu_state_interface_[8].get().get_value(),
      ctrl_interfaces_.imu_state_interface_[9].get().get_value();

  u_ = rotation_ * acceleration_ + g_;
  x_hat_ = A * x_hat_ + B * u_;
  y_hat_ = C * x_hat_;

  // Update the measurement value
  y_ << feet_pos_body_, feet_vel_body_, feet_h_;
  // Update the covariance matrix
  Ppriori = A * P * A.transpose() + Q;
  S = R + C * Ppriori * C.transpose();
  Slu = S.lu();
  Sy = Slu.solve(y_ - y_hat_);
  Sc = Slu.solve(C);
  SR = Slu.solve(R);
  STC = S.transpose().lu().solve(C);
  IKC = Eigen::MatrixXd::Identity(18, 18) - Ppriori * C.transpose() * Sc;

  x_hat_ += Ppriori * C.transpose() * Sy;
  P = IKC * Ppriori * IKC.transpose() +
      Ppriori * C.transpose() * SR * STC * Ppriori.transpose();

  // Using low pass filter to smooth the velocity
  low_pass_filters_[0]->addValue(x_hat_(3));
  low_pass_filters_[1]->addValue(x_hat_(4));
  low_pass_filters_[2]->addValue(x_hat_(5));
  x_hat_(3) = low_pass_filters_[0]->getValue();
  x_hat_(4) = low_pass_filters_[1]->getValue();
  x_hat_(5) = low_pass_filters_[2]->getValue();
}
} // namespace quadruped_controller